In [2]:
import pandas as pd
import matplotlib.pyplot as plt

In [24]:
path = "D:\Desktop\Bangalore Vehicle\APR23.xlsx"
data = pd.read_excel(path)

In [25]:
# Cleaning
data = data[4:]
data.rename(columns={'Column2': 'Categories',
                     'Column3': 'Sold so far',
                     'Column4': 'Sold',
                    'Column5': 'Total'}, inplace=True)
data.drop(columns=['Column1'], inplace=True)

In [26]:
data

                          Categories Sold so far   Sold     Total
4                       Two Wheelers     7332587  34450   7367037
5                               Cars     2233327  12407   2245734
6                         Omni Buses        5013      2      5015
7                           Tractors       37741    111     37852
8                           Trailers       14693     41     14734
9      Construction Moving Equipment        3480    101      3581
10           Private Service Vehicle         477      3       480
11                    Other Vehicles       43099    709     43808
12  TOTAL NON TRANSPORT VEHICELES(A)     9670417  47824   9718241
13                 TRANSPORT VEHICLE         NaN    NaN       NaN
14   Multi Axled/Articulated Vehicle       15692     33     15725
15                Trucks and Lorries      185299    593    185892
16                             TOTAL      200991    626    201617
17              LIGHT GOODS VEHICLES         NaN    NaN       NaN
18                      Four Wheeler      191101   1020    192121
19                     Three Wheeler       68683    316     68999
20                             TOTAL      259784   1336    261120
21                             Buses      120903    231    121134
22                             TOTAL      120903    231    121134
23                            TAXIES         NaN    NaN       NaN
24                        Motor Cabs      208213    980    209193
25                         Maxi Cabs       56226    363     56589
26                            Others         130      0       130
27                             TOTAL      264569   1343    265912
28                     LMV PASSENGER         NaN    NaN       NaN
29                 Three Seater(A/R)      300661   1475    302136
30                    Other Vehicles       84623    274     84897
31                             TOTAL      385284   1749    387033
32                TOTAL TRANSPORT(B)     1231531   5285   1236816
33                     TOTAL (A)+(B)    10901948  53109  10955057